/*************************************************************************
	> File Name: test01.cpp
	> Author:zhaoyihong 
	> Mail:zhaoyihong_at_126_dot_com 
	> Created Time: 2015年03月09日 星期一 20时36分43秒
 ************************************************************************/

#include  <iostream>
#include    "stdio.h"
using namespace std;

int main()
{
  int a,x;
  //!x++是从右到左, x++为0,!x++为1
  //条件判断执行了2次 初始化-判断-执行-判断-结束
  for(a=0,x=0; a<=1 && !x++; )
  {
   a++;
  }
  printf("%d,%d\n",a,x); // 结果：1，2
 
  // &&具有短路属性,虽然执行了两次判断,但是x++只执行了一次
  // 初始化 - 判断 - 执行 - 判断 - 结束 ,其中第二次判断没有执行!x++
  for(a=0,x=0;a<=1 && !x++;a++)
  {
   a++;
  }
  printf("%d,%d\n",a,x);
 // 结果：2，1

}
