/*************************************************************************
	> File Name: test3.c
	> Author:zhaoyihong 
	> Mail:zhaoyihong_at_126_dot_com 
	> Created Time: 2015年03月09日 星期一 20时48分05秒
 ************************************************************************/

#include  <stdio.h>

int main()
{
     unsigned char a = 0xA5; // 10100101
     unsigned char b = ~a>>4;  //~00A5->115A >>4  0X0115 赋予unsigned char 0x15
     b = b;
     printf("b=%d\n",b);
    /*
    结果：245，即11110101
        说明：本题中如果不知道运算时编译器的自动类型转化，按照优先级的顺序，~高于>>，则得到结果是00000101，但是，由于在计算时，4默认为整型，故编译器先将a转化为000000A5后执行~运算，最后>>4，这样就能得到正确的结果。""
        */

}
